<a href="https://colab.research.google.com/github/g1-o/mcit-training-analysis/blob/main/notebooks/01_data_cleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Data Loading

In [1]:
import pandas as pd

df = pd.read_excel("Trainees.xlsx", header=3)
df.head()

,Id,First Name Ar,Secound Name Ar,Third Name Ar,Last Name Ar,First Name En,Second Name En,Third Name En,Last Name En,Gender Type,...,Faculty,Dept Name,Candidate Type,Academic Year,Military Status,Graduation Year,Program,Track,Job Profile,Insert Date
0,'110965439397300536510,ااا,ااا,ااا,اااا,aa,aa,aa,aa,Female,...,NaN,aa,SchoolGarduate,NaN,أدى الخدمة,1999.0,NaN,NaN,NaN,2025-04-28T17:04:45.074142
1,'113029244487320437796,شش,شش,شش,شش,aa,aa,aa,aa,Female,...,Others-عام,TEST FROM gs,Graduate,NaN,NaN,2025.0,Intensive Diploma Program,Software Development,Software Testing Specialist,2025-05-27T07:40:34.589569
2,'114898500495790620427,لل,لل,لل,لل,aa,aa,aa,aa,Female,...,Others-تجارى تخصصي,bis,Student,الثانية,إعفاء مؤقت,NaN,NaN,NaN,NaN,2025-05-30T09:48:25.13658
3,'106703513700444713351,احمد,مم,مم,مم,Aa,Aa,Aa,Aa,Male,...,Others-هندسي عام,Test,Graduate,NaN,إعفاء نهائي,2018.0,Intensive Diploma Program,Software Development,Professional Mobile App Developer,2025-05-27T09:03:43.05048
4,'102525449437020224781,سس,سسس,سسسس,سسسسسس,aaa,aaaa,aaaaa,aaaaa,Female,...,NaN,بكالوريوس زراعة,0,NaN,NaN,2022.0,Intensive Diploma Program,Applied Technologies,Agriculture Tech Specialist,2025-05-28T13:03:30.930691

#Data Exploration

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40859 entries, 0 to 40858
Data columns (total 36 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Id                 40858 non-null  object
 1   First Name Ar      40857 non-null  object
 2   Secound Name Ar    40857 non-null  object
 3   Third Name Ar      40857 non-null  object
 4   Last Name Ar       40605 non-null  object
 5   First Name En      40857 non-null  object
 6   Second Name En     40857 non-null  object
 7   Third Name En      40856 non-null  object
 8   Last Name En       40557 non-null  object
 9   Gender Type        40857 non-null  object
 10  Birth Date         40857 non-null  object
 11  Email              40857 non-null  object
 12  Governorate Code   40857 non-null  object
 13  Address            39857 non-null  object
 14  City               38599 non-null  object
 15  Mobile             40857 non-null  float64
 16  Mobile Secondary   31233 non-null  float64
 17  Telephone          20203 non-null  float64
 18  Linked In Account  29341 non-null  object
 19  Profile Image Url  30305 non-null  object
 20  Attach Pdf Url     40857 non-null  object
 21  National Id        40857 non-null  float64
 22  Status             40857 non-null  object
 23  Institution Type   39427 non-null  object
 24  Grade              39427 non-null  object
 25  University         39427 non-null  object
 26  Faculty            39427 non-null  object
 27  Dept Name          40853 non-null  object
 28  Candidate Type     40857 non-null  object
 29  Academic Year      19169 non-null  object
 30  Military Status    33159 non-null  object
 31  Graduation Year    21688 non-null  float64
 32  Program            36942 non-null  object
 33  Track              36942 non-null  object
 34  Job Profile        36942 non-null  object
 35  Insert Date        40857 non-null  object
dtypes: float64(5), object(31)
memory usage: 11.2+ MB

In [3]:
values_to_drop = ['aaa', 'test', 'xxx', 'null', 'n/a', 'aa', 'aaaa', 'aaa', 'aaaaa', 'Aa' ,"اا" ,"شش"] or len(str(val)) < 3
df = df[~df.isin(values_to_drop).any(axis=1)]

In [4]:
df.columns

Index(['Id', 'First Name Ar', 'Secound Name Ar', 'Third Name Ar',
       'Last Name Ar', 'First Name En', 'Second Name En', 'Third Name En',
       'Last Name En', 'Gender Type', 'Birth Date', 'Email',
       'Governorate Code', 'Address', 'City', 'Mobile', 'Mobile Secondary',
       'Telephone', 'Linked In Account', 'Profile Image Url', 'Attach Pdf Url',
       'National Id', 'Status', 'Institution Type', 'Grade', 'University',
       'Faculty', 'Dept Name', 'Candidate Type', 'Academic Year',
       'Military Status', 'Graduation Year', 'Program', 'Track', 'Job Profile',
       'Insert Date'],
      dtype='object')

#Data Cleaning

In [5]:
df.drop(['Id', 'First Name Ar', 'Secound Name Ar', 'Third Name Ar',
       'Last Name Ar', 'First Name En', 'Second Name En', 'Third Name En',
       'Last Name En', 'Telephone','Profile Image Url', 'Attach Pdf Url', 'Address','Mobile Secondary', 'City' ], axis=1, inplace=True)

In [6]:
df.columns

Index(['Gender Type', 'Birth Date', 'Email', 'Governorate Code', 'Mobile',
       'Linked In Account', 'National Id', 'Status', 'Institution Type',
       'Grade', 'University', 'Faculty', 'Dept Name', 'Candidate Type',
       'Academic Year', 'Military Status', 'Graduation Year', 'Program',
       'Track', 'Job Profile', 'Insert Date'],
      dtype='object')

In [7]:
df.isnull().sum()

Gender Type              2
Birth Date               2
Email                    2
Governorate Code         2
Mobile                   2
Linked In Account    11509
National Id              2
Status                   2
Institution Type      1427
Grade                 1427
University            1427
Faculty               1427
Dept Name                6
Candidate Type           2
Academic Year        21680
Military Status       7695
Graduation Year      19169
Program               3912
Track                 3912
Job Profile           3912
Insert Date              2
dtype: int64

In [8]:
df.dropna(subset=['Program'], inplace=True)
df.shape[0]

36935

In [9]:
df['Academic Year'].unique()

array(['الثالثة', 'الرابعة', nan, 'الأولى', 'الثانية', 'الخامسة',
       'السادسة', 'إعدادي'], dtype=object)

In [10]:
df['Graduation Year'].unique()

array([  nan, 2025., 2024., 2013., 2023., 2017., 2009., 2022., 2016.,
       2018., 2021., 2015., 2019., 2020., 2012., 2014., 2003., 2000.,
       1999., 2011., 2010., 2006., 2008., 2002., 2005., 2004., 2001.,
       2028., 2007., 2027., 1993., 1997., 2026., 1995., 1998., 1996.,
       1991., 1987., 1992., 1989., 2029., 1990., 1979., 1994., 1976.,
          0., 2030.])

In [11]:
df['Graduation Year'] = df['Graduation Year'].fillna('Student')
df['Academic Year'] = df['Academic Year'].fillna('Graduate')

In [12]:
df['Grade'] = df['Grade'].fillna('Unknown')
df['University'] = df['University'].fillna('Unknown')

In [13]:
df['LinkedIn_Status'] = df['Linked In Account'].apply(
    lambda x: 'Has Account' if str(x).strip() else 'No Account'
)

In [14]:
df['Candidate Type'].unique()

array(['Student', 'Graduate', 'SchoolGarduate', '0'], dtype=object)

In [15]:
def infer_candidate_type(text):
    text = str(text).strip()

    if any(word in text for word in ['بكالوريوس', 'ليسانس','معهد']):
        return 'Graduate'
    elif 'دبلوم' in text:
        return 'SchoolGarduate'
    elif 'طالب' in text or 'طالبه' in text or 'ثانوية' in text:
        return 'Student'
    elif text in ['', 'nan', 'ممممم']:
        return 'Unknown'
    else:
        return 'Other'

# Replace only '0' values in Candidate Type
df['Candidate Type'] = df.apply(
    lambda row: infer_candidate_type(row['Dept Name']) if row['Candidate Type'] == '0' else row['Candidate Type'],
    axis=1
)

In [16]:
df['Candidate Type'].unique()

array(['Student', 'Graduate', 'SchoolGarduate', 'Other'], dtype=object)

In [17]:
df = df[df['Candidate Type'] != 'Other']

In [18]:
df.loc[df['Faculty'].isna(), 'Faculty'] = df.loc[df['Faculty'].isna(), 'Candidate Type']

In [19]:
def categorize_Faculty(name):
    name = str(name).strip()

    if name in ["", "0", "nan", "ممممم"]:
        return name  # keep it as-is

    if any(x in name for x in ["هندسة", "Engineering", "عمرانى", " للطاقة ", "Others-هندسي تخصصي", "Others-هندسي عام", "Field of Engineering"]):
        return "Engineering"

    elif any(x in name for x in ["تربية", "رياض الأطفال", "رياض الاطفال","رياض اطفال"]):
        return "Education"

    elif any(x in name for x in ["صيدلة", "للصحة العامة","تمريض", "طب", "أسنان","Doctor of Pharmacy", "علاج طبيعي", "Medicine", "الصحة", "Field of Medicine", "Physical Therapy", "Dentisty"]):
        return "Medicine & Nursing"

    elif any(x in name for x in ["تجارة", "إدارة الأعمال", "العلاقات الصناعية", "اقتصاد", "تمويل", "بزنس", "Business", "الأعمال", "إدارة", "ادارة", "الأدارة", "للإدارة", "الإدارة", "التسويق", "تجارى", "Administrative"]):
        return "Business & Commerce"

    elif any(x in name for x in ["حاسب", "تكنولوجيا", "نظم", "معلومات", "ذكاء", "تقنيات", "تكنولوجية", "التنمية التكنولوجية", "التكنولوجي"]):
        return "Technology & Computer"

    elif any(x in name for x in ["علوم", "Science", "Basic"]):
        return "Science"

    elif any(x in name for x in ["آداب", "حقوق", "شريعة", "لغة", "لغات", "صحافة", "اللغات", "السن", "الأزهرية", "لحضارات", "الازهرية", "الأعلام", "للأعلام", "إعلام", "الألسن", "الاثار", "الأثار", "الآثار", "إنسانية", "اعلام", "اتصال", "دعوة", "أصول", "الاداب", "الأداب", "اجنماعية", "اسلامية", "الأسلامية", "خدمة اجتماعية", "قانون", "الاجنماعية", "دراسات", "خدمة"]):
        return "Humanities & Social Science"

    elif any(x in name for x in ["فنون", "موسيقى"]):
        return "Arts"

    elif any(x in name for x in ["سياحة", "فندقة", "الضيافة"]):
        return "Tourism & Hospitality"

    elif any(x in name for x in ["نقل دولى", "لوجستيات", "لوجيستيات", "اللوجستية", "اللوجيستية", "الامداد","النقل الدولى واللوجيستات"]):
        return "Logistics & Supply Chain"

    elif any(x in name for x in ["زراعة", "بيطري", "استزراع", "زراعات", "الثروة السمكية", "الزراعي"]):
        return "Agriculture & Veterinary"

    elif any(x in name for x in ["رياضة", "تربية رياضية"]):
        return "Physical Education"

    elif any(x in name for x in ["البرامج الدولية", "التعلم المستمر"]):
        return "Specialized Programs"

    elif any(x in name for x in ["تعليم صناعى", "لتعليم الصناعى"]):
        return "Industrial Education"

    else:
        return name  # keep original value if no match found

In [20]:
df["Faculty_category"] = df["Faculty"].apply(categorize_Faculty)

In [21]:
df["Faculty_category"].unique()

array(['Technology & Computer', 'Education', 'Engineering',
       'Business & Commerce', 'Science', 'Others-عام-مؤهل فوق متوسط',
       'Humanities & Social Science', 'Agriculture & Veterinary',
       'SchoolGarduate', 'Tourism & Hospitality',
       'Logistics & Supply Chain', 'Industrial Education', 'Others-عام',
       'Medicine & Nursing', 'Arts', 'Graduate', 'Specialized Programs',
       'Student'], dtype=object)

In [22]:
df = df[~df['Faculty_category'].isin([ 'Others-عام', 'Others-عام-مؤهل فوق متوسط'])]

In [23]:
df['Faculty_category'].value_counts()

Faculty_category
Technology & Computer          11356
Business & Commerce             6675
Engineering                     6186
Humanities & Social Science     4736
Education                       1829
Agriculture & Veterinary        1603
Science                         1532
SchoolGarduate                  1168
Medicine & Nursing              1027
Tourism & Hospitality            178
Arts                             130
Industrial Education              81
Logistics & Supply Chain          19
Graduate                          14
Specialized Programs               3
Student                            3
Name: count, dtype: int64

In [24]:
df['Age'] = pd.to_datetime('today').year - pd.to_datetime(df['Birth Date']).dt.year

In [25]:
df['Age'].unique()

array([22, 23, 24, 26, 34, 20, 32, 36, 29, 19, 25, 27, 21, 33, 30, 35, 31,
       28, 18, 45, 37, 46, 43, 38, 51, 39, 48, 40, 41, 42, 47, 44, 56, 50,
       53, 54, 49, 17, 59, 55, 60, 58, 52, 57, 16], dtype=int32)

In [26]:
df[['Governorate Code', 'Governorate']] = df['Governorate Code'].str.split(' - ', expand=True)

In [27]:
df.loc[df['Gender Type'] == 'Female', 'Military Status'] = df.loc[df['Gender Type'] == 'Female', 'Military Status'].fillna('Not Applicable')

In [28]:
df['Military Status'].value_counts()

Military Status
إعفاء مؤقت        19856
Not Applicable     7009
إعفاء نهائي        4925
أدى الخدمة         4749
Name: count, dtype: int64

In [29]:
df['Military Status']=df['Military Status'].replace({'إعفاء مؤقت': 'Temporary Exemption',
    'إعفاء نهائي': 'Final Exemption', 'أدى الخدمة ': 'Completed Service'})
df['Military Status'].value_counts()

Military Status
Temporary Exemption    19856
Not Applicable          7009
Final Exemption         4925
Completed Service       4749
Name: count, dtype: int64

In [30]:
df['Academic Year']=df['Academic Year'].replace({'إعدادي': 'Engineering Preparatory Year',
    'الأولى': 'First Year',
    'الثانية': 'Second Year',
    'الثالثة': 'Third Year',
    'الرابعة': 'Fourth Year',
    'الخامسة': 'Fifth Year',
    'السادسة': 'Sixth Year',
    'nan': 'Unknown'})
df['Academic Year'].value_counts()

Academic Year
Graduate                        19435
Third Year                       5472
Fourth Year                      4590
Second Year                      3637
First Year                       2735
Fifth Year                        558
Engineering Preparatory Year       65
Sixth Year                         48
Name: count, dtype: int64

In [31]:
df['Mobile']=df['Mobile'].astype(str)
df['National Id']=df['National Id'].astype(int)

In [32]:
df['Governorate'].value_counts()

Governorate
Cairo             7042
Giza              4628
Alexandria        2819
Dakahlia          2399
Sharkia           2319
Qaliubiya         2219
Gharbiya          2126
Menofia           2008
Assiut            1259
Beheira           1238
Minya             1206
Beni Suef         1056
Sohag             1028
Kafr Al sheikh     949
Fayoum             934
Qena               659
Damietta           606
Ismailia           467
Aswan              311
Suez               281
Port Said          263
Luxor              250
Red Sea            143
North Sinai        105
New Valley          97
Marsa Matrouh       82
South Sinai         46
Name: count, dtype: int64

In [33]:
df.to_excel('trainees_cleaned4.xlsx', index=False)

#from google.colab import files
#files.download('trainees_cleaned4.xlsx')